tutorials/impHybridPorousInterFoam/gas-bubble/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

lx0 0;
ly0 0;
lz0 0;

lx1 40;
ly1 40;
lz1 0.5;

vertices
(
    ($lx0 $ly0 $lz0)    //0
    ($lx1 $ly0 $lz0)    //1
    ($lx1 $ly1 $lz0)    //2
    ($lx0 $ly1 $lz0)    //3
    ($lx0 $ly0 $lz1)    //4
    ($lx1 $ly0 $lz1)    //5
    ($lx1 $ly1 $lz1)    //6
    ($lx0 $ly1 $lz1)    //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 1) simpleGrading (1 1 1)
);


edges
(
);


boundary
(
    top   //outlet
    {
        type cyclic;
        neighbourPatch  bottom;  
        faces
        (
            (3 7 6 2)
        );
    }

    bottom  //inlet
    {
        type cyclic;
        neighbourPatch  top;
        faces
        (
            (0 4 5 1)
        );
    }

    left
    {
        type cyclic;
        neighbourPatch  right;
        faces
        (
            (0 3 7 4)
        );
    }

    right
    {
        type cyclic;
        neighbourPatch  left;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
